//* 1번과 2번의 결과를 예측해보자!
//*-------------------------------------------------------------------------------
//@1번------------------------------------------------
//? 그렇다면 이걸 호출스택에 어떻게 표현하지?
/*function first() {
  second();
  console.log('첫 번째');
}
function second() {
  third();
  console.log('두 번째');
}
function third() {
  console.log('세 번째');
}
first();
*/
//@2번------------------------------------------------
//? 이건 호출스택에 어떻게 표현하지?
/*
function first() {
  console.log('첫 번째');
  second();
}
function second() {
  console.log('두 번째');
  third();
}
function third() {
  console.log('세 번째');
  throw new Error('콜스택에서 에러찾기 테스트') //! 예외가 던져질 때, 콜 스택에서 어떻게 호출하는지 보여준다.
}
first();
*/
//* stack overflow
//*-------------------------------------------------------------------------------

